Revit 2026 API

# GeomCombinationAllMembers Property

---

All elements that are joined in this geometry combination.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CombinableElementArray AllMembers { get; }
```
```vb
Public ReadOnly Property AllMembers As CombinableElementArray
	Get
```
```cpp
public:
property CombinableElementArray^ AllMembers {
	CombinableElementArray^ get ();
}
```
```fsharp
member AllMembers : CombinableElementArray with get
```

#### Property Value

CombinableElementArray

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when this geometry combination has already been deleted. |

All members are generic forms, for more information, refer toGenericForm.

#### Reference

GeomCombination Class

Autodesk.Revit.DB Namespace